In [1]:
import pandas as pd

In [2]:
ipl_df = pd.read_csv("IPL IMB381IPL2013.csv")

In [3]:
type(ipl_df)

pandas.core.frame.DataFrame

In [17]:
pd.set_option('display.max_columns',10)

In [11]:
ipl_df.head(5)

,Sl.NO.,PLAYER NAME,AGE,COUNTRY,TEAM,...,ECON,SR-BL,AUCTION YEAR,BASE PRICE,SOLD PRICE
0,1,"Abdulla, YA",2,SA,KXIP,...,8.90,13.93,2009,50000,50000
1,2,Abdur Razzak,2,BAN,RCB,...,14.50,0.00,2008,50000,50000
2,3,"Agarkar, AB",2,IND,KKR,...,8.81,24.90,2008,200000,350000
3,4,"Ashwin, R",1,IND,CSK,...,6.23,22.14,2011,100000,850000
4,5,"Badrinath, S",2,IND,CSK,...,0.00,0.00,2011,100000,800000

In [9]:
list(ipl_df.columns)

['Sl.NO.',
 'PLAYER NAME',
 'AGE',
 'COUNTRY',
 'TEAM',
 'PLAYING ROLE',
 'T-RUNS',
 'T-WKTS',
 'ODI-RUNS-S',
 'ODI-SR-B',
 'ODI-WKTS',
 'ODI-SR-BL',
 'CAPTAINCY EXP',
 'RUNS-S',
 'HS',
 'AVE',
 'SR-B',
 'SIXERS',
 'RUNS-C',
 'WKTS',
 'AVE-BL',
 'ECON',
 'SR-BL',
 'AUCTION YEAR',
 'BASE PRICE',
 'SOLD PRICE']

In [18]:
ipl_df.transpose()

,0,1,2,3,4,...,125,126,127,128,129
Sl.NO.,1,2,3,4,5,...,126,127,128,129,130
PLAYER NAME,"Abdulla, YA",Abdur Razzak,"Agarkar, AB","Ashwin, R","Badrinath, S",...,"Yadav, AS",Younis Khan,Yuvraj Singh,Zaheer Khan,"Zoysa, DNT"
AGE,2,2,2,1,2,...,2,2,2,2,2
COUNTRY,SA,BAN,IND,IND,IND,...,IND,PAK,IND,IND,SL
TEAM,KXIP,RCB,KKR,CSK,CSK,...,DC,RR,KXIP+,MI+,DC
PLAYING ROLE,Allrounder,Bowler,Bowler,Bowler,Batsman,...,Batsman,Batsman,Batsman,Bowler,Bowler
T-RUNS,0,214,571,284,63,...,0,6398,1775,1114,288
T-WKTS,0,18,58,31,0,...,0,7,9,288,64
ODI-RUNS-S,0,657,1269,241,79,...,0,6814,8051,790,343
ODI-SR-B,0.0,71.41,80.62,84.56,45.93,...,0.0,75.78,87.58,73.55,95.81
ODI-WKTS,0,185,288,51,0,...,0,3,109,278,108
ODI-SR-BL,0.0,37.6,32.9,36.8,0.0,...,0.0,86.6,44.3,35.4,39.4
CAPTAINCY EXP,0,0,0,0,0,...,0,1,1,0,0
RUNS-S,0,0,167,58,1317,...,49,3,1237,99,11
HS,0,0,39,11,71,...,16,3,66,23,10
AVE,0.0,0.0,18.56,5.8,32.93,...,9.8,3.0,26.32,9.9,11.0
SR-B,0.0,0.0,121.01,76.32,120.71,...,125.64,42.85,131.88,91.67,122.22
SIXERS,0,0,5,0,28,...,2,0,67,1,0
RUNS-C,307,29,1059,1125,0,...,0,0,569,1783,99
WKTS,15,0,29,49,0,...,0,0,23,65,2
AVE-BL,20.47,0.0,36.52,22.96,0.0,...,0.0,0.0,24.74,27.43,49.5
ECON,8.9,14.5,8.81,6.23,0.0,...,0.0,0.0,7.02,7.75,9.0
SR-BL,13.93,0.0,24.9,22.14,0.0,...,0.0,0.0,21.13,21.26,33.0
AUCTION YEAR,2009,2008,2008,2011,2011,...,2010,2008,2011,2008,2008
BASE PRICE,50000,50000,200000,100000,100000,...,50000,225000,400000,200000,100000
SOLD PRICE,50000,50000,350000,850000,800000,...,750000,225000,1800000,450000,110000

In [21]:
ipl_df.shape

(130, 26)

In [22]:
ipl_df.COUNTRY.value_counts()

COUNTRY
IND    53
AUS    22
SA     16
SL     12
PAK     9
NZ      7
WI      6
ENG     3
BAN     1
ZIM     1
Name: count, dtype: int64

In [25]:
pd.crosstab(ipl_df['AGE'], ipl_df['COUNTRY'])

COUNTRY  AUS  BAN  ENG  IND  NZ  PAK  SA  SL  WI  ZIM
AGE
1          2    0    0   13   0    0   0   1   0    0
2         10    1    3   35   5    7  11   8   5    1
3         10    0    0    5   2    2   5   3   1    0

In [31]:
ipl_df[['PLAYER NAME','SOLD PRICE']].sort_values("SOLD PRICE")[0:100]

        PLAYER NAME  SOLD PRICE
73       Noffke, AA       20000
46      Kamran Khan       24000
0       Abdulla, YA       50000
1      Abdur Razzak       50000
118   Van der Merwe       50000
..              ...         ...
7     Bollinger, DE      700000
91   Sangakkara, KC      700000
28    Gilchrist, AC      700000
60     McCullum, BB      700000
24       Gambhir, G      725000

[100 rows x 2 columns]

In [32]:
ipl_df['premium'] = ipl_df['SOLD PRICE'] - ipl_df['BASE PRICE']

In [38]:
ipl_df[['PLAYER NAME','BASE PRICE','SOLD PRICE','premium']]

      PLAYER NAME  BASE PRICE  SOLD PRICE  premium
0     Abdulla, YA       50000       50000        0
1    Abdur Razzak       50000       50000        0
2     Agarkar, AB      200000      350000   150000
3       Ashwin, R      100000      850000   750000
4    Badrinath, S      100000      800000   700000
..            ...         ...         ...      ...
125     Yadav, AS       50000      750000   700000
126   Younis Khan      225000      225000        0
127  Yuvraj Singh      400000     1800000  1400000
128   Zaheer Khan      200000      450000   250000
129    Zoysa, DNT      100000      110000    10000

[130 rows x 4 columns]

In [42]:
ipl_df.groupby('AGE')['SOLD PRICE'].mean()

AGE
1    720250.000000
2    484534.883721
3    520178.571429
Name: SOLD PRICE, dtype: float64

In [44]:
sold_price_by_age = ipl_df.groupby('AGE')['SOLD PRICE'].mean().reset_index()

In [45]:
sold_price_by_age

   AGE     SOLD PRICE
0    1  720250.000000
1    2  484534.883721
2    3  520178.571429

In [49]:
sold_price_by_age_role = ipl_df.groupby(['AGE','PLAYING ROLE'])['SOLD PRICE'].mean().reset_index()

In [50]:
sold_price_by_age_role

    AGE PLAYING ROLE    SOLD PRICE
0     1   Allrounder  5.875000e+05
1     1      Batsman  1.110000e+06
2     1       Bowler  5.177143e+05
3     2   Allrounder  4.494000e+05
4     2      Batsman  6.547619e+05
5     2       Bowler  3.979310e+05
6     2    W. Keeper  4.677273e+05
7     3   Allrounder  7.666667e+05
8     3      Batsman  4.576923e+05
9     3       Bowler  4.143750e+05
10    3    W. Keeper  7.000000e+05

In [59]:
soldprice_comparison = sold_price_by_age_role.merge(sold_price_by_age,on="AGE",how="outer")

In [57]:
soldprice_comparison

    AGE PLAYING ROLE  SOLD PRICE_x   SOLD PRICE_y
0     1   Allrounder  5.875000e+05  720250.000000
1     1      Batsman  1.110000e+06  720250.000000
2     1       Bowler  5.177143e+05  720250.000000
3     2   Allrounder  4.494000e+05  484534.883721
4     2      Batsman  6.547619e+05  484534.883721
5     2       Bowler  3.979310e+05  484534.883721
6     2    W. Keeper  4.677273e+05  484534.883721
7     3   Allrounder  7.666667e+05  520178.571429
8     3      Batsman  4.576923e+05  520178.571429
9     3       Bowler  4.143750e+05  520178.571429
10    3    W. Keeper  7.000000e+05  520178.571429